{"data":{"markdownRemark":{"id":"347b4595-f777-5044-af09-b3f22749c3c8","html":"<p>Since my last post, I was fortunate enough to complete a couple of internships at LinkedIn and PlayStation and graduate from Georgia Tech. That pretty much sums it up, along with great memories along the way. But suffice to say the least, it’s been one wild ride, from COVID-19 impacting the economy, to graduating virtually from one of the top engineering institutes in the nation. I’m somewhat proud of what I’ve done so far :)</p>\n<p>As much as I didn’t like the assignments and all-nighters I had to pull for assignments and exams, I’m starting to feel a bit of Stockholm Syndrome creep into my system. I’m going to inevitably miss the school experience, where I was surrounded by friends and peers whom were of my own age. I do feel that now, I have entered a completely new stage in life. It’s exciting, of course, in a different way.</p>\n<p>I haven’t quite planned out what my plans are for now, but here’s a list of what I have planned next, taking into account that I will be invested in my full time job at LinkedIn.</p>\n<h2 id=\"participating-in-coding-competitions-google-kickstart-code-jam-usaco-past-questions\"><a href=\"#participating-in-coding-competitions-google-kickstart-code-jam-usaco-past-questions\" aria-label=\"participating in coding competitions google kickstart code jam usaco past questions permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Participating in coding competitions (Google Kickstart, Code Jam, USACO past questions)</h2>\n<p>I have to admit, the prospect of doing coding competitions wasn’t really there for me in the beginning. After all, it took me a good two years to finally develop a solid fundamentals with regards to computer science, specifically data structures &#x26; algorithms. </p>\n<p>However, after taking several advanced level algorithm courses and potentially expanding on it more with potential part-time graduate school prospects, I thought why not seek to learn what I know about dynamic programming, graph algorithms, computational mathematics, and many more to work? That leads into the second topic.</p>\n<h2 id=\"do-an-online-masters-in-computer-science-while-working\"><a href=\"#do-an-online-masters-in-computer-science-while-working\" aria-label=\"do an online masters in computer science while working permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Do an online master’s in computer science while working</h2>\n<p>I’ve thought about it a great deal, and I realized that pursuing additional knowledge and challenging myself was actually pretty cool. In particular, I really enjoyed the A.I. curriculum I did during my undergraduate years at GT, namely Deep Learning and Machine Learning. Even though they were graduate level courses, I really enjoyed the rigor to which you got to dive into a topic and understand it. While I may have gained some knowledge of the basics, I think it would be cool to further apply and expand upon this knowledge.</p>\n<p>Instead of OMSCS at Georgia Tech ($8,000 for an entire MSCS program online, with no difference between the one done on campus), I’m looking to do </p>","fields":{"slug":"/posts/last-year-2019-2020","tagSlugs":["/tag/reflection/","/tag/personal/","/tag/goals/"]},"frontmatter":{"date":"2020-05-08T09:30:08.000Z","description":"It's been a while. Read this post to see how I reflected on this past year of events, and how I plan for future events.","tags":["Reflection","Personal","Goals"],"title":"I just graduated. What's next?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/last-year-2019-2020"}}