{"data":{"markdownRemark":{"id":"4d335a58-4c18-5ed2-88cd-e76137949f8d","html":"<p>I present here some technical indicators I might consider using other than price and volume before entering and exiting a trade, and the general mindset I adhere to before estimating the potential risk-reward and opportunity flow.</p>\n<p>These ideas mostly apply to mid-large cap traded stocks. No penny stocks here! If you’re interested in trading penny stocks or doing day trading, VWAP tends to be a good indicator. I also did not talk about EMA here, but you should definitely study this indicator with regards to trend reversals across any time period.</p>\n<h3 id=\"1-support-and-resistance-lines\"><a href=\"#1-support-and-resistance-lines\" aria-label=\"1 support and resistance lines permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>1) Support and resistance lines</h3>\n<p>In my opinion, this should be the very first thing one should look at before deciding to trade a stock.</p>\n<p>Based on the stock, there are two types of SR lines that you might think to observe - that is either… </p>\n<ul>\n<li>Trendline Support/Resistance</li>\n<li>Key Support/Resistance</li>\n</ul>\n<p>Both are important to draw out on the chart in either a full year period or half a year. </p>\n<p>Identifying support and resistance lines sets the very basis of whether or not your trade is highly probable to be successful and profitable, in addition to maximum potential gain. </p>\n<p>The most basic example is to buy closer to or at support and to short sell or sell off at resistance zones when the momentum in one direction has died off. The problem with this is that direction is not accounted for, hence why trendline supports and resistances are better plays to understand.</p>\n<p><strong>This is far from being an easily profitable strategy and you need more data to back this up, but I’ll talk about that a bit later.</strong></p>\n<p>Let me introduce an example with NVDA:</p>\n<p><img src=\"https://www.tradingview.com/x/oAIK432C/\"></p>\n<blockquote>\n<p>NVDA is an example of a stock that was part of the cryptocurrency burst with its competitor AMD. While NVDA has a sizeable market share in Datacenter and GPUs, it wasn’t enough to stop the stock from dropping from 291 to 125 in a matter of months. </p>\n</blockquote>\n<p>Draw the lines based on history, and based on where the stock has bounced versus where the stock has rejected further uptrending moves. Remember that once a stock has been confirmed to have broken through resistance, this typically means that our new resistance has become new support. As an example, 162 is now our key support for NVDA.</p>\n<p>Also, drawing the intra-monthly trend support/resistance lines allow us to see that NVDA is currently in an ascending triangle pattern. This means that the stock is closing at higher lows and highs, and is moving upwards overall. </p>\n<p>The stock is back on track, but there are still resistance zones to break out from. The potential breakout zones (202.79, 173.03, 161.94, 143.27) with the top 2 being resistance zones and bottom 2 being support zones show a few things when doing a case study on NVDA.</p>\n<h4 id=\"i-trading-range\"><a href=\"#i-trading-range\" aria-label=\"i trading range permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>I. Trading range</h4>\n<p>In the short term (intra-week), we see that it is very likely without an external catalyst that the stock will trade within the 174 - 162 zone. This is because this range is our higher and lower bound of support and resistance.</p>\n<p>The better key piece of information to take notice of however is the trendline trading range. It is more likely that NVDA will consistently trade within that pattern, moving up and down when encountering resistance and support. The range is probably closer to that of 178 - 171.50 within the coming days.</p>\n<h4 id=\"ii-the-current-price-breaks-resistance-but-just-slightly\"><a href=\"#ii-the-current-price-breaks-resistance-but-just-slightly\" aria-label=\"ii the current price breaks resistance but just slightly permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>II. The current price breaks resistance, but just slightly</h4>\n<p>In unexpected fashion, the stock broke through resistance slightly.</p>\n<p>However, at this point in time we see that the stock did two things.</p>\n<ul>\n<li>Is approaching or at trendline resistance</li>\n<li>Broke through prior key resistance in 4 months</li>\n</ul>\n<p>What is the probability that NVDA makes a runner here? Probably not a lot.</p>\n<ul>\n<li>\n<p>Look at the volume. The volume candles are getting smaller, which means less and less people are willing to trade the stock and are waiting for another opportunity. </p>\n<ul>\n<li>Smaller green candles, bigger red candles</li>\n</ul>\n</li>\n</ul>\n<p>The probability that NVDA does a slight drawback to the trendline support is more likely however, and then once again one has to be able to be prepared to be vigilant in analyzing which way the stock goes from there. If it continues its uptrend, buying at trendline support might prove to be a nice discount. </p>\n<p>I would personally short the stock in this case.</p>\n<h3 id=\"2-relative-strength-index-rsi\"><a href=\"#2-relative-strength-index-rsi\" aria-label=\"2 relative strength index rsi permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>2) Relative Strength Index (RSI)</h3>\n<blockquote>\n<p>The relative strength index (RSI) is a momentum indicator that measures the magnitude of recent price changes to evaluate overbought or oversold conditions in the price of a stock or other asset. The RSI is displayed as an oscillator (a line graph that moves between two extremes) and can have a reading from 0 to 100. - <a href=\"https://www.investopedia.com/terms/r/rsi.asp\">Investopedia on RSI</a></p>\n</blockquote>\n<p>If the stock is being classified as overbought by RSI but it was still uptrending, maybe it will continue to go up, but the possibility of it making an accelerated move upwards when its classified as overbought on the 6-month chart is rather low. </p>\n<p>In that case, it is better to not rush and to wait for an opportunity.</p>\n<p>Of course, sentiment may turn the stock on its head and soon enough the stock may continue to soar and reach new highs even at an overbought stage. There are many factors in play here.</p>\n<p>Be careful though, the RSI also changes based on the timeframe selected. Watch how the RSI doesn’t completely encompass this huge move in 2 days (NVDA dropped from 200 to 144):</p>\n<p><img src=\"https://www.tradingview.com/x/boJTTHuo/\"></p>\n<p><em>Use the RSI to support your thesis, and not to change or found it.</em></p>\n<h3 id=\"3-fibonacci-retracements\"><a href=\"#3-fibonacci-retracements\" aria-label=\"3 fibonacci retracements permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>3) Fibonacci retracements</h3>\n<blockquote>\n<p>In technical analysis, a Fibonacci retracement is created by taking two extreme points (usually a major peak and trough) on a stock chart and dividing the vertical distance by the key Fibonacci ratios of 23.6%, 38.2%, 50%, 61.8% and 100%. Once these levels are identified, horizontal lines are drawn and used to identify possible support and resistance levels. - <a href=\"https://www.investopedia.com/ask/answers/05/fibonacciretracement.asp\">Investopedia on Fib. retracements</a></p>\n</blockquote>\n<p><img src=\"https://www.tradingview.com/x/WxEP9D2N/\"></p>\n<p>In addition to doing trendline and key support/resistance analysis, fibonacci retracements are also great at identifying where the stock is at in terms of support/resistance levels. You can see that when the stock is trading within a decently consistent range and is not overly volatile, the stock tends to trade off the middle line. </p>\n<p>Personally, I find that if the supports and resistance zones matches closely with my fibonacci retracements, the reversals and predictions tend to be a tad bit more accurate (backed by more data and trading volume)</p>\n<h3 id=\"4-patterns\"><a href=\"#4-patterns\" aria-label=\"4 patterns permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>4) Patterns</h3>\n<p>Patterns tend to repeat themselves in the market. I did identify an ascending triangle with NVDA, but there are numerous other patterns. Namely, head and shoulders, inverse head and shoulders, descending triangle, <strong>wedges</strong>, and more.</p>\n<h4 id=\"i-triangles\"><a href=\"#i-triangles\" aria-label=\"i triangles permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>I. Triangles</h4>\n<p>Triangles are pretty simple. Draw trendline resistance and support, keep in mind overall market sentiment, check news, and generally given that there are no external catalysts prices should continue in that direction.</p>\n<p><strong>However, the triangle almost always eventually develops into a wedge.</strong> A wedge provides potential room for volatility plays.</p>\n<h4 id=\"ii-wedges\"><a href=\"#ii-wedges\" aria-label=\"ii wedges permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>II. Wedges</h4>\n<p>In this market, I tend to trade the bullish indicators of the market, though at this moment (March 20th, 2019), the market seems to be on the overbought side. On the polar sides of overbought and oversoldness, I find that wedges tend to breakout more than usual in the other direction (overbought ends with a sell-off, and oversold ends with a pump).</p>\n<p>Here’s an example of a wedge with AAPL (I know there’s some forward-looking bias here but I want to show an example with a frequently traded stock).</p>\n<p><img src=\"https://www.tradingview.com/x/lTVdmOUX/\"></p>\n<p>As you can see, <strong>as the range within the trending resistance and support lines diminish, the price is likely going to bounce in one direction or the other.</strong> Typically, it goes the other way from its original direction (ascending triangle into downtrend, descending triangle into uptrend). Sometimes it continues the same outlook, but that is dependent largely on news, general market sentiment (investor/trader confidence), and maybe earnings.</p>\n<h3 id=\"trading-on-news\"><a href=\"#trading-on-news\" aria-label=\"trading on news permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Trading on News</h3>\n<p>I actually made most (and lost) most of my money through news. After going through good and bad episodes of buying and selling the news, I have come to a few conclusions. </p>\n<p>There are two types of news that one should pay attention to. Also keep in mind that in scenarios like this, I think as both a trader and an investor it is sometimes a gamble. Maybe anomalies like PEAD may help explain some things, but no one knows for sure.</p>\n<p>Only historical data and a good sense of psychology will be the most beneficial in this scenario.</p>\n<p>Anyways, here are the two types which are pretty simple:</p>\n<ol>\n<li>Long-term damaging and potential signal of danger to the company (Blue Apron business model, Kraft-Heinz record losses, and overall decreasing in popularity and demand)</li>\n<li>Impulse news or short-term impact news (Analyst downgrade, the Boeing crash, Johnson &#x26; Johnson baby powder scandal)</li>\n</ol>\n<p>When the first news shows up, you will probably know it. Take a look at Stamps.com (STMP) if you aren’t sure.</p>\n<p>Here’s how I decide that the 2nd part of the impact news can be a potential play.</p>\n<h5 id=\"johnson--johnson-case\"><a href=\"#johnson--johnson-case\" aria-label=\"johnson  johnson case permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Johnson &#x26; Johnson Case</h5>\n<p>When Johnson &#x26; Johnson (JNJ) talked about the baby powder scandal in December 2018, the stock dropped significantly. Non-stop reporting for news coverage and revenue comes from talking about topics such as these, so that is to be expected. Surely enough, JNJ lost up to 15% of its share value within a couple weeks. </p>\n<p>Slowly but surely, we now see it return from 123 to 138. Why? JNJ from the fundamental side seemed extremely strong. Baby powder is one product, when JNJ deals with thousands of products and is well-renowned. </p>\n<h5 id=\"boeing-case\"><a href=\"#boeing-case\" aria-label=\"boeing case permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Boeing Case</h5>\n<p>Boeing is a more recent and much, much more tragic case. It also proves the case of company resilience of DOW companies. Survivorship bias is prevalent in backtest models, which is why I choose to base a lot of my quant strategies on mega cap stocks, but more on that for another time.</p>\n<p>An investor understands that Boeing holds an extremely large market share and means of production when it comes to aircraft. In addition to airlines, the government is possibly Boeing’s biggest customer when it comes to aircraft. Nearly all major airlines operate Boeing aircraft, and not exclusively to the Boeing 737 Max Series.</p>\n<p>As of current news, a lot of bad news have been consistently pricing in, ultimately leading to the grounding of all Boeing 737 Max aircraft until a definite resolution has been made. This will definitely cut into Boeing’s earnings and revenue as the company will have to pay large penalties and deal with PR issues.</p>\n<p>Even so, Boeing still holds consistently at 370, and I remember explicitly that the day Boeing dropped from 420 to 370, it bounced right back up to 400 in just one day. Of course, that was until bad news were only expanded upon. </p>\n<p>Boeing in the long-term, let’s say 5-10 years from now will be slightly dented from this incident. So what does an investor think? The average investor will think, “This is the time to buy Boeing at a discount!”</p>\n<h2 id=\"closing-remarks\"><a href=\"#closing-remarks\" aria-label=\"closing remarks permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Closing remarks</h2>\n<p>These are probably the main technical indicators other than moving averages that I think about before entering a trade. I’m currently also delving into trading psychology audiobooks on Audible just for fun, though I will probably focus more on understanding the quantitative side of trading.</p>","fields":{"slug":"/posts/basic-technical-analysis-trading","tagSlugs":["/tag/finance/"]},"frontmatter":{"date":"2019-03-11T00:00:00.000Z","description":"Exploring some of the basic technical analysis techniques I have learned through trading.","tags":["Finance"],"title":"Basic Technical Analysis for Swing Trading"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/basic-technical-analysis-trading"}}